## Name: David Geng

# Instruction to Pandas
## Important package for Data Munging Tasks
#### Two important data structure 
* Series: One dimensional array of indexed data
* DataFrame: Two dimensional array of index data

In [1]:
# import pandas
import pandas as pd
# import matplotlib for visualization
import matplotlib.pyplot as plt
# import seaborn for visualization
import seaborn as sns

## Series

In [2]:
# Creating a series: sequence of values
a= pd.Series([1,2,3,4,5,6,7,8,9,10])
print(a)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [3]:
# access values
a.values

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [4]:
# access index
a.index

RangeIndex(start=0, stop=10, step=1)

In [5]:
# extracting single elements
a[2]

3

In [6]:
#  getting 10th elements
a[9]

10

In [7]:
# slicing
a[0:3]

0    1
1    2
2    3
dtype: int64

In [8]:
# slicing
a[5:9]

5    6
6    7
7    8
8    9
dtype: int64

### Summary Functions

<!-- max -->

In [9]:
# max
a.max()

10

In [10]:
# min
a.min()

1

In [11]:
# describe
a.describe()

count    10.00000
mean      5.50000
std       3.02765
min       1.00000
25%       3.25000
50%       5.50000
75%       7.75000
max      10.00000
dtype: float64

In [12]:
# sorting default ascending
a.sort_values()

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [13]:
# sorting descending
a.sort_values(ascending = False)

9    10
8     9
7     8
6     7
5     6
4     5
3     4
2     3
1     2
0     1
dtype: int64

In [14]:
# sorting descending
b = a.sort_values(ascending = False)

In [15]:
a.sort_values(ascending = False, inplace = True)
print(a)

9    10
8     9
7     8
6     7
5     6
4     5
3     4
2     3
1     2
0     1
dtype: int64

In [16]:
print(b)

9    10
8     9
7     8
6     7
5     6
4     5
3     4
2     3
1     2
0     1
dtype: int64

In [17]:
# HW create a Series of age of your 10 friends
age = pd.Series([23,22,45,65,34,52,12,17,44,77])

In [18]:
# extract 6th element
age[5]

52

In [19]:
# Extract from 1st to 5th
age[0:5]

0    23
1    22
2    45
3    65
4    34
dtype: int64

In [20]:
# Use describe function to get teh summary starts of age
age.describe()

count    10.000000
mean     39.100000
std      21.429212
min      12.000000
25%      22.250000
50%      39.000000
75%      50.250000
max      77.000000
dtype: float64

## DataFrame: Two Dimensional

### Creating DataFrame Manually

In [21]:
# DataFrame from a list
height = [170, 180, 190, 165, 185]
df_list = pd.DataFrame(height, columns = ['Height'], index = [10,20,30,40,50])
print(df_list)

    Height
10     170
20     180
30     190
40     165
50     185

In [22]:
# creating a dictionary of towns and number ice cream shop
names = {'Town' : ['Valparaiso', 'Chesterton', 'Kouts', 'Portage', 'Munster'],
         'Shops' : [20, 25, 15, 20, 30]}
names

{'Town': ['Valparaiso', 'Chesterton', 'Kouts', 'Portage', 'Munster'],
 'Shops': [20, 25, 15, 20, 30]}

In [23]:
df_dict = pd.DataFrame(names)
print(df_dict)

         Town  Shops
0  Valparaiso     20
1  Chesterton     25
2       Kouts     15
3     Portage     20
4     Munster     30

## DataFrame: Secondary Data

In [24]:
# # Loading Data
# from google.colab import files
# upload = files.upload()

In [25]:
# reading data
df = pd.read_csv('hr.csv')

In [26]:
# head for top rows
df.head(6)

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [27]:
# tail for the bottom rows
df.tail()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
14994,0.40,0.57,2,151,3,0,1,0,support,low
14995,0.37,0.48,2,160,3,0,1,0,support,low
14996,0.37,0.53,2,143,3,0,1,0,support,low
14997,0.11,0.96,6,280,4,0,1,0,support,low
14998,0.37,0.52,2,158,3,0,1,0,support,low

In [28]:
# df info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14999 entries, 0 to 14998
Data columns (total 10 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   satisfaction_level     14999 non-null  float64
 1   last_evaluation        14999 non-null  float64
 2   number_project         14999 non-null  int64
 3   average_montly_hours   14999 non-null  int64
 4   time_spend_company     14999 non-null  int64
 5   Work_accident          14999 non-null  int64
 6   left                   14999 non-null  int64
 7   promotion_last_5years  14999 non-null  int64
 8   sales                  14999 non-null  object
 9   salary                 14999 non-null  object
dtypes: float64(2), int64(6), object(2)
memory usage: 1.1+ MB

In [30]:
# df describe
df.describe()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years
count,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000
mean,0.612834,0.716102,3.803054,201.050337,3.498233,0.144610,0.238083,0.021268
std,0.248631,0.171169,1.232592,49.943099,1.460136,0.351719,0.425924,0.144281
min,0.090000,0.360000,2.000000,96.000000,2.000000,0.000000,0.000000,0.000000
25%,0.440000,0.560000,3.000000,156.000000,3.000000,0.000000,0.000000,0.000000
50%,0.640000,0.720000,4.000000,200.000000,3.000000,0.000000,0.000000,0.000000
75%,0.820000,0.870000,5.000000,245.000000,4.000000,0.000000,0.000000,0.000000
max,1.000000,1.000000,7.000000,310.000000,10.000000,1.000000,1.000000,1.000000

In [31]:
# df describe
df.describe(include = 'all')

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
count,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999.000000,14999,14999
unique,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,10,3
top,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,sales,low
freq,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4140,7316
mean,0.612834,0.716102,3.803054,201.050337,3.498233,0.144610,0.238083,0.021268,NaN,NaN
std,0.248631,0.171169,1.232592,49.943099,1.460136,0.351719,0.425924,0.144281,NaN,NaN
min,0.090000,0.360000,2.000000,96.000000,2.000000,0.000000,0.000000,0.000000,NaN,NaN
25%,0.440000,0.560000,3.000000,156.000000,3.000000,0.000000,0.000000,0.000000,NaN,NaN
50%,0.640000,0.720000,4.000000,200.000000,3.000000,0.000000,0.000000,0.000000,NaN,NaN
75%,0.820000,0.870000,5.000000,245.000000,4.000000,0.000000,0.000000,0.000000,NaN,NaN
max,1.000000,1.000000,7.000000,310.000000,10.000000,1.000000,1.000000,1.000000,NaN,NaN

In [32]:
# df dtypes
df.dtypes

satisfaction_level       float64
last_evaluation          float64
number_project             int64
average_montly_hours       int64
time_spend_company         int64
Work_accident              int64
left                       int64
promotion_last_5years      int64
sales                     object
salary                    object
dtype: object

In [33]:
# df columns
df.columns

Index(['satisfaction_level', 'last_evaluation', 'number_project',
       'average_montly_hours', 'time_spend_company', 'Work_accident', 'left',
       'promotion_last_5years', 'sales', 'salary'],
      dtype='object')

In [34]:
# df.values
df.values

array([[0.38, 0.53, 2, ..., 0, 'sales', 'low'],
       [0.8, 0.86, 5, ..., 0, 'sales', 'medium'],
       [0.11, 0.88, 7, ..., 0, 'sales', 'medium'],
       ...,
       [0.37, 0.53, 2, ..., 0, 'support', 'low'],
       [0.11, 0.96, 6, ..., 0, 'support', 'low'],
       [0.37, 0.52, 2, ..., 0, 'support', 'low']], dtype=object)

In [35]:
# checking nulls
df.isnull().sum()

satisfaction_level       0
last_evaluation          0
number_project           0
average_montly_hours     0
time_spend_company       0
Work_accident            0
left                     0
promotion_last_5years    0
sales                    0
salary                   0
dtype: int64

In [36]:
# checking not nulls
df.notnull().sum()

satisfaction_level       14999
last_evaluation          14999
number_project           14999
average_montly_hours     14999
time_spend_company       14999
Work_accident            14999
left                     14999
promotion_last_5years    14999
sales                    14999
salary                   14999
dtype: int64